// Створити скрипт який виводить спливаюче попередження за допомогою alert(). 
// Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). 
// Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". 
// Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".
alert("Увага! Ця дія небезпечна.");
let isConfirmed = confirm("Ви підтверджуєте дію?");
alert(isConfirmed ? "Дякую за підтвердження!" : "Дію відмінено!");